print("Введите кординаты точки (x, y), x != 0 и y != 0")
a, b = (int(x) for x in (input().split()))
if (a > 0) and (b > 0):
    print("Значит точка с координатами (", a, ", ", b, ") лежит в 1 координатной четверти")
if (a < 0) and (b > 0):
    print("Значит точка с координатами (", a, ", ", b, ") лежит во 2 координатной четверти")
if (a < 0) and (b < 0):
    print("Значит точка с координатами (", a, ", ", b, ") лежит в 3 координатной четверти")
if (a > 0) and (b < 0):
    print("Значит точка с координатами (", a, ", ", b, ") лежит в 4 координатной четверти")