print("Введите количество учебных заданий в диапазоне 10-40")
n = int(input())
buf = ["десять", "одиннадцать", "дыкнадцать", "тринадцать", "четырнадцать", "пятнадцать", "шестнадцать", "семнадцать",
       "восемнадцать", "девятнадцать", "двацдать", "двадцать один", "двадцать два", "двадцать три", "двадцать четыре", "двадцать пять",
       "двадцать шесть", "двадцать семь", "двадцать восемь", "двадцать девять", "тридцать", "тридцать один", "тридцать два",
       "тридцать три", "трицать четыре", "Тридцать пять", "тридцать шесть", "тридцать семь", "тридцать восемь", "тридватьь девять", "сорок"]
if n == 21 or n == 31:
    print(buf[n-10], "учебное задание")
if (n >= 10 and n <= 20) or (n >= 25 and n <= 30) or (n >= 35 and n <= 40):
    print(buf[n-10], "учебных заданий")
if (n >= 22 and n <= 24) or (n >= 32 and n <= 34):
    print(buf[n-10], "учебных задания")