print("Введите число в диапазоне 1-999")
numb = int(input())
buf = {1: "один", 2: "два", 3: "три", 4: "четыре", 5: "пять", 6: "шесть", 7: "семь", 8: "восемь", 9: "девять", 10: "десять",
       11: "одиннадцать", 12: "двенадцать", 13: "тринадцать", 14: "четырнадцать", 15: "пятнадцать", 16: "шестнадцать", 17: "семнадцать",
       18: "восемнадцать", 19: "девятнадцать", 20: "двадцать", 30: "тридцать", 40: "сорок", 50: "пятьдесят", 60: "шестьдесят", 70: "семьдесят",
       80: "восемьдесят", 90: "девяносто", 100: "сто", 200: "двести", 300: "триста", 400: "четыреста", 500: "пятьсот", 600: "шестьсот",
       700: "семьсот", 800: "восемьсот", 900: "девятьсот"}
if len(str(numb)) == 1:
    print(buf[numb])
if len(str(numb)) == 2 and (numb <= 20):
    print(buf[numb])
if len(str(numb)) == 2 and (numb % 10 == 0) and (numb > 20):
    print(buf[numb])
elif len(str(numb)) == 2 and (numb > 20):
    print(buf[numb//10*10], buf[numb%10])
if len(str(numb)) == 3 and (numb % 100 == 0):
    print(buf[numb])
elif len(str(numb)) == 3 and (numb % 10 == 0):
    print(buf[numb//100*100], buf[numb//10%10*10])
elif len(str(numb)) == 3 and (numb % 100 < 20):
    print(buf[numb//100*100], buf[numb%100])
elif len(str(numb)) == 3:
    print(buf[numb//100*100], buf[numb//10%10*10], buf[numb%10])
